ToniHG/TFM_STM_TF/tfm_master_stm32f429i/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include <string.h>
#include <stdio.h>
#include "cmsis_os.h"
#include "can_protocol.h"
#include "fault_tolerance.h"
#include "stm32f429i_discovery_lcd.h"
#include "stm32f429i_discovery_sdram.h"
#include "stm32f429i_discovery_ts.h"
#include "FreeRTOS.h"
#include "stm32f4xx.h"
#include "stm32f4xx_hal_can.h"
#include "task.h"
#include "queue.h"

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan2;                      // Handle for CAN2 (used as Master in this example)
CAN_HandleTypeDef hcan1;
CRC_HandleTypeDef hcrc;                       // Handle for CRC (used for CRC16 calculation in fault tolerance)
DMA2D_HandleTypeDef hdma2d;                   // Handle for DMA2D (used for efficient LCD updates)
I2C_HandleTypeDef hi2c3;                      // Handle for I2C3 (used for touch screen, if needed)
LTDC_HandleTypeDef hltdc;                     // Handle for LTDC (used for driving the LCD)
SPI_HandleTypeDef hspi5;                      // Handle for SPI5 (used for the SD card, if needed)
TIM_HandleTypeDef htim1;                      // Handle for TIM1 (used for timing, if needed)
UART_HandleTypeDef huart1;                    // Handle for UART (used for debugging, e.g. with printf)
SDRAM_HandleTypeDef hsdram1;                  // Handle for SDRAM (used by the LCD)
volatile ft_status_t last_msg_status = FT_OK; // Status of the last processed message (for display purposes)
QueueHandle_t can_rx_queue;                   // FreeRTOS queue to receive CAN messages from the ISR
TaskHandle_t TaskProcess_Handle;              // Handle for the task that processes CAN messages
TaskHandle_t TaskDisplay_Handle;              // Handle for the task that updates the display
TaskHandle_t TaskWatchdog_Handle;             // Handle for the task that implements the watchdog functionality

/* Enum for GUI states */
typedef enum {
    DISPLAY_MAIN = 0,
    DISPLAY_NODE_1,
    DISPLAY_NODE_2,
    DISPLAY_NODE_3,
    DISPLAY_CONTROL
} estado_gui_t;
estado_gui_t actual_display = DISPLAY_MAIN;  // Variable to track the current screen being displayed
uint8_t update_display = 1;                 // Flag to force repainting the screen when changing states


/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CAN2_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_SPI5_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_LCD_Display_Init(void);
void CAN_Safe_Transmit(uint32_t target_can_id, uint32_t payload_data, msg_type_t msg_status);
void Reset_Slave_Context(uint8_t index);
void vProcessDataTask(void *argument);
void vUpdateDisplayTask(void *argument);
void vWatchdogTask(void *argument);

/* Private user code ---------------------------------------------------------*/
/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void) {
  /* MCU Configuration--------------------------------------------------------*/
  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();
  /* Configure the system clock */
  SystemClock_Config();
  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CRC_Init();
  MX_I2C3_Init();
  MX_TIM1_Init();
  MX_USART1_UART_Init();
  MX_LCD_Display_Init();
  MX_CAN2_Init();
  /* Initialize memory for Fault Tolerance can context */
  ft_init_context();
  /* Create the queue for CAN messages */
  can_rx_queue = xQueueCreate(10, sizeof(rtos_can_msg_t));
  /* Create the task for processing CAN messages high priority */
  xTaskCreate(vProcessDataTask, "Proccesador", 256, NULL, 2, &TaskProcess_Handle);
  /* Create the task for updating the display low priority */
  xTaskCreate(vUpdateDisplayTask, "Display", 256, NULL, 1, &TaskDisplay_Handle);
  /* Create the task for the watchdog */
  xTaskCreate(vWatchdogTask, "Watchdog", 256, NULL, 1, &TaskWatchdog_Handle);
  /* Start scheduler */
  vTaskStartScheduler();

  /* Infinite loop */
  while (1)
  {
    NULL;
  }
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 180;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 3;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Activate the Over-Drive mode
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief CAN2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_CAN2_Init(void) {
  /* Configure CAN2 */
  hcan2.Instance = CAN2;
  hcan2.Init.Prescaler = 9;
  hcan2.Init.Mode = CAN_MODE_NORMAL;
  hcan2.Init.SyncJumpWidth = CAN_SJW_1TQ;
  hcan2.Init.TimeSeg1 = CAN_BS1_7TQ;
  hcan2.Init.TimeSeg2 = CAN_BS2_2TQ;
  hcan2.Init.TimeTriggeredMode = DISABLE;
  hcan2.Init.AutoBusOff = ENABLE;
  hcan2.Init.AutoWakeUp = DISABLE;
  hcan2.Init.AutoRetransmission = DISABLE;
  hcan2.Init.ReceiveFifoLocked = DISABLE;
  hcan2.Init.TransmitFifoPriority = DISABLE;

  hcan1.Instance = CAN1;
  hcan1.Init.Prescaler = 24;      // 45MHz / 36 / 12TQ = 125 kbps (Igual que el esclavo)
  hcan1.Init.Mode = CAN_MODE_NORMAL; 
  hcan1.Init.SyncJumpWidth = CAN_SJW_1TQ;
  hcan1.Init.TimeSeg1 = CAN_BS1_12TQ;
  hcan1.Init.TimeSeg2 = CAN_BS2_2TQ;
  hcan1.Init.TimeTriggeredMode = DISABLE;
  hcan1.Init.AutoBusOff = ENABLE;
  hcan1.Init.AutoWakeUp = ENABLE;
  hcan1.Init.AutoRetransmission = ENABLE; 
  hcan1.Init.ReceiveFifoLocked = DISABLE;
  hcan1.Init.TransmitFifoPriority = DISABLE;

