ToniHG/TFM_STM_TF/tfm_master_stm32f429i/Core/Src/main.c
  CAN_RxHeaderTypeDef rx_header;
  uint8_t rx_data[8];
  rtos_can_msg_t incoming_msg;
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;

  /* Get the received message from the CAN peripheral */
  if (HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &rx_header, rx_data) == HAL_OK) {
    /* Safe slave id*/
    incoming_msg.sender_id = rx_header.StdId;
    memcpy(&incoming_msg.frame, rx_data, sizeof(can_frame_payload_t));
    /* Send the received message to the FreeRTOS queue */
    xQueueSendFromISR(can_rx_queue, &incoming_msg, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
  }
}

/**
 * @brief  Callback de interrupción: Confirma que el envío terminó con éxito
 */
void HAL_CAN_TxMailbox0CompleteCallback(CAN_HandleTypeDef *hcan) {
    // Aquí puedes poner un toggle de un LED verde para saber que el cableado está bien
}

/**
 * @brief  Task of FreeRTOS to process received CAN messages and apply Fault Tolerance treatment
 * @param  argument: Not used, but it's a pointer that you could use to pass data to the task if you wanted
 * @retval None
 */
void vProcessDataTask(void *argument) {
  /* Data to process from Queue */
  rtos_can_msg_t msg_to_process;

  while(1) {

    if (xQueueReceive(can_rx_queue, &msg_to_process, portMAX_DELAY) == pdPASS) {
      /* Determine the index of the slave based on its ID */
      uint8_t idx = 0;
      if (msg_to_process.sender_id == SLAVE1_ID) idx = 0;
      else if (msg_to_process.sender_id == SLAVE2_ID) idx = 1;
      else if (msg_to_process.sender_id == SLAVE3_ID) idx = 2;
      else continue; /* If the sender ID is not recognized, skip the rest of the processing */
      /* Process the message based on its type */
      slave_contexts[idx].last_seen_ticks = xTaskGetTickCount();
      if (slave_contexts[idx].is_muted) {
        /* If the node is waiting for sync, we only process heartbeat messages to check if it has recovered */
         if (msg_to_process.frame.msg_type != MSG_TYPE_HEARTBEAT) {
           continue; /* Skip non-heartbeat messages if the node is waiting for sync */
         }
      }
      if(slave_contexts[idx].waiting_for_sync) {
        /* If we are waiting for sync, we only process messages to check if the slave has resynced correctly */
        if (msg_to_process.frame.seq_number != 0) {
          continue; /* Skip non-SYNC_REQUIRED messages if we are waiting for sync */
        }
        else{
          slave_contexts[idx].waiting_for_sync = 0; /* If we receive a message with seq_number 0, it means the slave has resynced correctly */
        }
      }
      if (msg_to_process.frame.msg_type == MSG_TYPE_HEARTBEAT) {
        /* Analyze the first byte sent by the slave with the HC-SR04 status */
        if (msg_to_process.frame.payload_data[0] == 0x01) {
          slave_contexts[idx].hardware_fault = 1;
          slave_contexts[idx].is_muted = 1;
        } else {
          if (slave_contexts[idx].hardware_fault || slave_contexts[idx].is_muted) {
            Reset_Slave_Context(idx);
          }
          else {
            slave_contexts[idx].expected_seq_num = (msg_to_process.frame.seq_number + 1) % 256;
          }
        }
      } 
      else if (msg_to_process.frame.msg_type == MSG_TYPE_RADAR_DATA) {
        /* Process radar data with fault tolerance */
        last_msg_status = ft_process_message(&msg_to_process.frame, msg_to_process.sender_id);
          
        if (last_msg_status == FT_SYNC_REQUIRED) {
          CAN_Safe_Transmit(MASTER_ID, msg_to_process.sender_id, MSG_TYPE_SYNC_REQUIRED);
        }
      }
    }
  }
}

/**
 * @brief  Task of FreeRTOS to watchdog the slave nodes and mute them if they haven't sent a message in a long time (e.g., 5 seconds)
 * @param  argument: Not used, but it's a pointer that you could use to pass data to the task if you wanted
 * @retval None
 */
void vWatchdogTask(void *argument) {
  while(1) {
    TickType_t current_time = xTaskGetTickCount();
    
    for(int i = 0; i < 3; i++) {
      /* Si han pasado > 5000 ms desde el último mensaje recibido */
      if ((current_time - slave_contexts[i].last_seen_ticks) > pdMS_TO_TICKS(5000)) {
        if (!slave_contexts[i].is_muted) {
          slave_contexts[i].is_muted = 1;
        }
      }
    }
    vTaskDelay(pdMS_TO_TICKS(1000)); 
  }
}

/**
 * @brief  Functions to print text on the LCD at specific coordinates (for simplicity, we use a basic function that prints character by character)
 * @param  x: X coordinate on the LCD
 * @param  y: Y coordinate on the LCD
 * @param  text: Text to print
 * @retval None
 */
void print_at_anyfont(uint16_t x, uint16_t y, char* text) {
    int i = 0;
    uint16_t font_width = BSP_LCD_GetFont()->Width;
    
    while(text[i] != '\0') {
        BSP_LCD_DisplayChar(x + (i * font_width), y, text[i]);
        i++;
    }
}

/**
 * @brief  Function to reset the context of a slave node 
 * @param  index: Index of the slave node whose context needs to be reset
 * @retval None
 */
void Reset_Slave_Context(uint8_t index) {
  slave_contexts[index].is_muted = 0;
  slave_contexts[index].stats_crc_errors = 0;
  slave_contexts[index].stats_frames_lost = 0;
  slave_contexts[index].stats_frames_ok = 0;
  slave_contexts[index].consecutive_crc_errors = 0;
  slave_contexts[index].consecutive_seq_errors = 0;
  slave_contexts[index].sync_attempts = 0;
  slave_contexts[index].expected_seq_num = 0;
  slave_contexts[index].hardware_fault = 0;
  slave_contexts[index].waiting_for_sync = 0;
  slave_contexts[index].last_seen_ticks = xTaskGetTickCount();
  memset(slave_contexts[index].last_valid_data, 0, sizeof(uint32_t));
  if (!slave_contexts[0].is_muted) {
    // If we are unmuting the node, we can also send a SYNC_REQUIRED message to ask it to resync immediately
    CAN_Safe_Transmit(MASTER_ID, slave_contexts[index].slave_id, MSG_TYPE_SYNC_REQUIRED);
  }
}

/**
 * @brief  Task de FreeRTOS para actualizar la pantalla
 * @param  argument: No se usa, pero es un puntero que podrías usar para pasar datos a la tarea si quisieras
 * @retval None
 */
void vUpdateDisplayTask(void *argument) {
  char txt[40];
  TS_StateTypeDef TS_State;

  while(1) {
    /* Check touch state */
    BSP_TS_GetState(&TS_State);
    
    if (TS_State.TouchDetected) {
        uint16_t x = TS_State.X;
        uint16_t y = TS_State.Y;

        if (actual_display == DISPLAY_MAIN) {
          /* Take action based on touch coordinates */
          if (x < 120 && y > 160) { actual_display = DISPLAY_NODE_1; update_display = 1; }
          else if (x > 120 && y > 160) { actual_display = DISPLAY_NODE_2; update_display = 1; }
          else if (x < 120 && y < 160) { actual_display = DISPLAY_NODE_3; update_display = 1; }
          else if (x > 120 && y < 160) { actual_display = DISPLAY_CONTROL; update_display = 1; }
        } 
        else {
          /* If submenus check for return button */
          if (50 > y) { 
              actual_display = DISPLAY_MAIN; 
              update_display = 1; 
          }
          /* Check for control panel interactions */
          else if (actual_display == DISPLAY_CONTROL) {
            if (y > 50 && y < 110) { 
              Reset_Slave_Context(2);
            }
            else if (y > 110 && y < 170) { 
              Reset_Slave_Context(1);
            }
            else if (y > 170 && y < 230) { 
              Reset_Slave_Context(0);
            }
          }
        }
        /* To avoid excessive CPU usage */
        vTaskDelay(pdMS_TO_TICKS(250)); 
    }
    /* Render of menus */
    if (update_display) {
        BSP_LCD_Clear(LCD_COLOR_WHITE);      
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
        if (actual_display == DISPLAY_MAIN) {
          /* Render main menu */
          BSP_LCD_SetTextColor(LCD_COLOR_DARKGRAY);
          BSP_LCD_DrawLine(120, 0, 120, 320);
          BSP_LCD_DrawLine(0, 160, 240, 160);

