ToniHG/TFM_STM_TF/tfm_master_stm32f429i/Core/Src/main.c
          BSP_LCD_SetFont(&Font16);
          BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
          print_at_anyfont(15, 60, "SLAVE 1");
          print_at_anyfont(135, 60, "SLAVE 2");
          print_at_anyfont(15, 220, "SLAVE 3");
          BSP_LCD_SetTextColor(LCD_COLOR_RED);
          print_at_anyfont(135, 220, "PANNEL");
          print_at_anyfont(135, 240, "CONTROL");
        }
        else {
          /* Render back button */
          BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
          BSP_LCD_FillRect(0, 280, 240, 40); 
          BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
          BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
          BSP_LCD_SetFont(&Font16);
          print_at_anyfont(60, 292, "[ < BACK ]");
          BSP_LCD_SetBackColor(LCD_COLOR_WHITE); 
          BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        }
        update_display = 0; 
    }

    /* Render dynamic data */
    BSP_LCD_SetFont(&Font16);
    
    /* Display node information */
    for (int i = 0; i < 3; i++) {
      if ((actual_display == DISPLAY_NODE_1 && i == 0) ||
          (actual_display == DISPLAY_NODE_2 && i == 1) ||
          (actual_display == DISPLAY_NODE_3 && i == 2)) 
      {
        BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
        sprintf(txt, "STATISTICS NODE %d", i+1);
        print_at_anyfont(10, 20, txt);
        
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_SetFont(&Font12);
        /* Display the last valid data received from the slave (angle and distance) */
        uint8_t angle = slave_contexts[i].last_valid_data[0];
        uint16_t dist = (slave_contexts[i].last_valid_data[1] << 8) | slave_contexts[i].last_valid_data[2];
        if (slave_contexts[i].is_muted) {
          sprintf(txt, "Dist: --- cm | Ang: ---");
          print_at_anyfont(10, 60, txt);
        } 
        else {
          if (dist == 0xFFFF) {
            sprintf(txt, "Dist: OUT OF RANGE | Ang: %03u", angle);
          } else {
            sprintf(txt, "Dist: %03u cm | Ang: %03u", dist, angle);
          }
          print_at_anyfont(10, 60, txt);
        }
        print_at_anyfont(10, 60, txt);
        sprintf(txt, "Seq number: %02u   ", slave_contexts[i].expected_seq_num);
        print_at_anyfont(10, 80, txt);
        sprintf(txt, "Faults CRC: %lu    ", slave_contexts[i].stats_crc_errors);
        print_at_anyfont(10, 110, txt);
        sprintf(txt, "Lost Frames: %lu  ", slave_contexts[i].stats_frames_lost);
        print_at_anyfont(10, 130, txt);

        /* Actual state */
        if (slave_contexts[i].is_muted) {
          BSP_LCD_SetTextColor(LCD_COLOR_RED);TickType_t age = xTaskGetTickCount() - slave_contexts[i].last_seen_ticks;
          if (age > pdMS_TO_TICKS(5000)) {
            print_at_anyfont(10, 160, "STATUS: TIMEOUT      ");
          } else if (slave_contexts[i].hardware_fault) {
            print_at_anyfont(10, 160, "STATUS: HW FAULT     ");
          } else {
            print_at_anyfont(10, 160, "STATUS: MUTED        ");
          }
        } else if (slave_contexts[i].consecutive_crc_errors > 0) {
          BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
          print_at_anyfont(10, 160, "STATUS: ALERT CRC!   ");
        } else {
          BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
          print_at_anyfont(10, 160, "STATUS: ACTIVE (OK)  ");
        }
      }
    }

    /* Render control panel */
    if (actual_display == DISPLAY_CONTROL) {
      BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
      print_at_anyfont(10, 20, "GESTION DE NODOS");
      
      BSP_LCD_SetFont(&Font12);
      for(int i = 0; i < 3; i++) {
        uint16_t y_pos = 80 + (i * 60);
        
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        sprintf(txt, "NODO %d:", i+1);
        print_at_anyfont(10, y_pos, txt);
        
        /* Status indicator */
        if (slave_contexts[i].is_muted) {
          BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
          BSP_LCD_FillCircle(180, y_pos + 5, 15);
          print_at_anyfont(80, y_pos, "[ OFF ] ");
        } else {
          BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
          BSP_LCD_FillCircle(180, y_pos + 5, 15);
          BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
          print_at_anyfont(80, y_pos, "[ ACTIVE ] ");
        }
      }
    }
    /* Refresh control (5 Hz)*/
    vTaskDelay(pdMS_TO_TICKS(100));
  }
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void){
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

void CAN1_RX0_IRQHandler(void)
{
  HAL_CAN_IRQHandler(&hcan1);
}

/**
 * @brief Callback que salta cuando el hardware CAN sufre un error físico grave
 */
void HAL_CAN_ErrorCallback(CAN_HandleTypeDef *hcan) {
    HAL_CAN_ResetError(hcan);
    HAL_CAN_ActivateNotification(hcan, CAN_IT_RX_FIFO0_MSG_PENDING);
}
